In [44]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

%matplotlib inline

In [45]:
data = pd.read_csv("C:\\Users\\acer\\Downloads\\Fraud_check.csv")

In [46]:
data.head(10)

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
5,NO,Divorced,33329,116382,0,NO
6,NO,Divorced,83357,80890,8,YES
7,YES,Single,62774,131253,3,YES
8,NO,Single,83519,102481,12,YES
9,YES,Divorced,98152,155482,4,YES

In [47]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
Undergrad          600 non-null object
Marital.Status     600 non-null object
Taxable.Income     600 non-null int64
City.Population    600 non-null int64
Work.Experience    600 non-null int64
Urban              600 non-null object
dtypes: int64(3), object(3)
memory usage: 21.2+ KB

In [48]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Taxable.Income,600.0,55208.375000,26204.827597,10003.0,32871.50,55074.5,78611.75,99619.0
City.Population,600.0,108747.368333,49850.075134,25779.0,66966.75,106493.5,150114.25,199778.0
Work.Experience,600.0,15.558333,8.842147,0.0,8.00,15.0,24.00,30.0

In [49]:
data.shape

(600, 6)

In [50]:
obj = data.select_dtypes('object')

In [51]:
obj.head(10)

  Undergrad Marital.Status Urban
0        NO         Single   YES
1       YES       Divorced   YES
2        NO        Married   YES
3       YES         Single   YES
4        NO        Married    NO
5        NO       Divorced    NO
6        NO       Divorced   YES
7       YES         Single   YES
8        NO         Single   YES
9       YES       Divorced   YES

In [52]:
obj.Undergrad.value_counts()

YES    312
NO     288
Name: Undergrad, dtype: int64

In [53]:
obj.Urban.value_counts()

YES    302
NO     298
Name: Urban, dtype: int64

In [54]:
label = LabelEncoder()

In [55]:
data['Undergrad'] = label.fit_transform(data['Undergrad'])

In [56]:
data['Marital.Status'] = label.fit_transform(data['Marital.Status'])

In [57]:
data['Urban'] = label.fit_transform(data['Urban'])

In [58]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0

In [60]:
data.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [62]:
data.rename(columns={"Marital.Status":"Status"},inplace=True)

In [64]:
data.columns

Index(['Undergrad', 'Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
Undergrad          600 non-null int32
Marital.Status     600 non-null int32
Taxable.Income     600 non-null int64
City.Population    600 non-null int64
Work.Experience    600 non-null int64
Urban              600 non-null int32
dtypes: int32(3), int64(3)
memory usage: 21.2 KB

In [17]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Undergrad,600.0,0.520000,0.500017,0.0,0.00,1.0,1.00,1.0
Marital.Status,600.0,1.046667,0.821958,0.0,0.00,1.0,2.00,2.0
Taxable.Income,600.0,55208.375000,26204.827597,10003.0,32871.50,55074.5,78611.75,99619.0
City.Population,600.0,108747.368333,49850.075134,25779.0,66966.75,106493.5,150114.25,199778.0
Work.Experience,600.0,15.558333,8.842147,0.0,8.00,15.0,24.00,30.0
Urban,600.0,0.503333,0.500406,0.0,0.00,1.0,1.00,1.0

In [18]:
plt.figure(figsize=(19,9))

#sns.pairplot(data = data)

plt.show()

In [65]:
# Adding new Column in DataFrame as Status where Taxable.Income is less than 30k
# taking as Risky (0)
# else Good (1)

data['++++']=0
for x in range(0,len(data)):
    if data['Taxable.Income'].iloc[x]<=30000:
        data['Status'].iloc[x] =  0
    else:
        data['Status'].iloc[x] = 1

In [66]:
data.head(10)

,Undergrad,Status,Taxable.Income,City.Population,Work.Experience,Urban,++++
0,0,1,68833,50047,10,1,0
1,1,1,33700,134075,18,1,0
2,0,1,36925,160205,30,1,0
3,1,1,50190,193264,15,1,0
4,0,1,81002,27533,28,0,0
5,0,1,33329,116382,0,0,0
6,0,1,83357,80890,8,1,0
7,1,1,62774,131253,3,1,0
8,0,1,83519,102481,12,1,0
9,1,1,98152,155482,4,1,0

In [71]:
xTrain,xTest, yTrain,yTest = train_test_split(data.drop('Status',1),data.Status,test_size=0.2)

In [72]:
dt = DecisionTreeClassifier(criterion= 'entropy',max_depth=4)

In [73]:
dt = dt.fit(xTrain,yTrain)

In [74]:
yPred = dt.predict(xTest)

In [75]:
yPred

array([1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0,
       0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 1, 1])

In [76]:
print(accuracy_score(yTest,yPred))

1.0